Repository: chivke/serveliza
Catalog: docs/locale/*/LC_MESSAGES/contributing.po
Languages: es

source: Contributing
es: Constribuyendo

source: Contributions are welcome, and they are greatly appreciated! Every little bit helps, and credit will always be given.
es: Las contribuciones son benvenidas y apreciadas. Cualquier ayuda es bien sirve y será reconocida en los créditos.

source: You can contribute in many ways:
es: Puedes contribuir de muchas maneras:

source: Types of Contributions
es: Maneras de constribuir

source: Report Bugs
es: Reportar bugs

source: Report bugs at https://github.com/chivke/serveliza/issues.
es: Reporta los bugs en https://github.com/chivke/serveliza/issues.

source: If you are reporting a bug, please include:
es: Si vas a reportar un bug, favor incluir:

source: Your operating system name and version.
es: El nombre de tu sistema operativo y su versión.

source: Any details about your local setup that might be helpful in troubleshooting.
es: Cualquier detalle sobre tu entorno y configuración local será de utilidad para su resolución.

source: Detailed steps to reproduce the bug.
es: Detalle las etapas para reproducir el bug.

source: Fix Bugs
es: Arreglar bugs

source: Look through the GitHub issues for bugs. Anything tagged with "bug" and "help wanted" is open to whoever wants to implement it.
es: Revisa Github issues si hay bugs sin resolver. Cualquier issue marcada como "bug" and "help wanted" están abiertos a ser resueltos.

source: Implement Features
es: Implementa características

source: Look through the GitHub issues for features. Anything tagged with "enhancement" and "help wanted" is open to whoever wants to implement it.
es: Revisa Github issues si hay características sin resolver. Cualquier que esté marcado como "enhancement" y "help wanted" están abiertas a serimplementadas."

source: Write Documentation
es: Escribir documentación

source: serveliza could always use more documentation, whether as part of the official serveliza docs, in docstrings, or even on the web in blog posts, articles, and such.
es: Serveliza siempre requiere mayor documentación, ya sea en alguna parte de sus docs, en los docstring o tutoriales, guías, artículos, etc.

source: Submit Feedback
es: Enviar retroalimentación

source: The best way to send feedback is to file an issue at https://github.com/chivke/serveliza/issues.
es: La mejor manera enviar una retroalimentación es abriendo un issueen https://github.com/chivke/serveliza/issues.

source: If you are proposing a feature:
es: Si estas proponiendo una característica:

source: Explain in detail how it would work.
es: Explica en detalle cómo trabajaría.

source: Keep the scope as narrow as possible, to make it easier to implement.
es: Manten el alcance de la descripción, para hacer más fácil su implementación.

source: Remember that this is a volunteer-driven project, and that contributions are welcome :)
es: Recuerda que este es un proyecto conducido voluntariamente y todas las constribuciones son bienvenidas.

source: Get Started!
es: Empezar

source: Ready to contribute? Here's how to set up `serveliza` for local development.
es: Listo para contribuir? Acá hay una guía para levantar serveliza en un entorno local de desarrollo.

source: Fork the `serveliza` repo on GitHub.
es: Realiza un fork del repo de `serveliza` en GitHub.

source: Install system requirements to use `pdftotext <https://github.com/jalan/pdftotext>`::
es: Instala los requerimientos del sistema para usar `pdftotext <https://github.com/jalan/pdftotext>`::

source: Clone your fork locally::
es: Clona el fork localmente::

source: Create a virtualenv in to your local copy. Assuming you have python3-venv installed, this is how you set up your fork for local development::
es: Crea un entorno virtual en tu copia local. Asumiendo que tienes python3-venv instalado, así sería la habilitación del entorno de desarrollo local del fork::

source: Create a branch for local development::
es: Crea una rama para el desarrollo local::

source: Now you can make your changes locally.
es: Realiza los cambios localmente.

source: When you're done making changes, check that your changes pass flake8 and the tests, including testing other Python versions with tox::
es: Cuando estes listo realizando cambios, chequea que tus cambios pasan flake8 y los tests, incluyendo el testing de otras versiones con tox::

source: If you made changes that affect the documentation, it is necessary to update the pot files for internationalization::
es: Si realizas cambios que afectan a la documentación, es necesario actualizar los archivos pot para la internacionalización.

source: Commit your changes and push your branch to GitHub::
es: Comitea tus cambios y haz un push de tu rama en GitHub::

source: Submit a pull request through the GitHub website.
es: Envía un pull request a través de la página de GitHub.

source: Pull Request Guidelines
es: Guía para Pull Request

source: Before you submit a pull request, check that it meets these guidelines:
es: Antes de enviar un pull request, verifica esta guía:

source: The pull request should include tests.
es: El pull request debe incluir tests.

source: If the pull request adds functionality, the docs should be updated. Put your new functionality into a function with a docstring, and add the feature to the list in README.rst.
es: Si el pull request agrega funcionalidad, se deben actualizar los docs. Documenta tu nueva funcionalidad en los docstring y agregala a las características del README.rst.

source: To run a subset of tests::
es: Correr un subconjunto de tests::

source: Deploying
es: Desplegando

source: A reminder for the maintainers on how to deploy. Make sure all your changes are committed (including an entry in HISTORY.rst). Then run::
es: Un recordatorio para los mantenedores sobre como desplegar. Asegurate que todos los cambios están commitiados (incluída la entrada en HISTORY.rst). Luego corre::

source: Travis will then deploy to PyPI if tests pass.
es: Travis desplegará en PyPI si pasan los tests
