Repository: chivke/serveliza
Catalog: docs/locale/*/LC_MESSAGES/usage.po
Languages: es

source: Usage
es: Uso

source: Serveliza can be used in different ways.
es: Serveliza puede usarse de distintas maneras.

source: Command line usage
es: Uso de línea de comandos

source: If you run from the command line you can access help on its use.
es: Si se corre desde la línea de comandos puedes acceder a ayuda de como usarlo.

source: As well as each of the available subcommands.
es: También para cada uno de sus subcomandos disponibles.

source: Programmatic usage
es: Uso programático

source: You can use the serveliza components by importing from their sub-packages as :py:mod:`serveliza.roll`, :py:mod:`serveliza.utils` or :py:mod:`serveliza.mixins`.
es: Puede usar los componentes de serveliza importándolos como subpaquetes como :py:mod:`serveliza.roll`, :py:mod:`serveliza.utils` o :py:mod:`serveliza.mixins`.

source: For example, you can import the main class that works with electoral rolls.
es: Por ejemplo, si puedes importar la clase principal que trabaja con padrones electorales.

source: It can also be imported in abbreviated form defined in the ``__init__.py`` file.
es: También puede ser importada en forma abreviada, definida en el archivo ``__init__.py``.

source: Inside serveliza, the module of the same name defines functions as shortcuts for specific actions, instantiating the classes in a transparent way. The command line interface is powered by these functions.
es: Dentro de serveliza, el módulo del mismo nombre define funciones para acceso rápido a diferentes acciones, instanciando las clases en forma transparente. La interfaz de línea de comandos funciona a través de estas funciones.

source: For example, you can get a pandas dataframe object through a function:
es: Por ejemplo, puedes obtener un objecto dataframe de pandas a través de la función:

source: That otherwise it would be like this:
es: Esto de otra manera sería así:
